-   tags:
        - attack.discovery
        - attack.t1526
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: email.amazonaws.com
            eventName:
                - GetSendQuota
                - ListIdentities
        selection_ioc_ip:
            sourceIPAddress:
                - 107.151.188.91
                - 112.215.253.179
                - 114.122.132.171
                - 140.213.98.125
                - 140.213.103.106
                - 140.213.103.218
                - 84.32.188.147
        selection_ioc_ua:
            userAgent|contains: aws-sdk-go-v2/1.21.2
        condition: selection and (selection_ioc_ip or selection_ioc_ua)
    level: low
-   tags:
        - attack.discovery
        - attack.t1087
        - attack.t1087.004
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: iam.amazonaws.com
            eventName:
            - ListUsers
            - ListGroupsForUser
            - ListInstanceProfiles
            - ListSSHPublicKeys
        selection_ioc_ip:
            sourceIPAddress:
                - 107.151.188.91
                - 112.215.253.179
                - 114.122.132.171
                - 140.213.98.125
                - 140.213.103.106
                - 140.213.103.218
                - 84.32.188.147
        selection_ioc_ua:
            userAgent|contains: aws-sdk-go-v2/1.21.2
        condition: selection and (selection_ioc_ip or selection_ioc_ua)
    level: medium
-   tags:
        - attack.t1069
        - attack.t1069.003
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventName: SimulatePrincipalPolicy
            eventSource: iam.amazonaws.com
            requestParameters.actionNames|contains:
                - iam:PutUserPolicy
                - iam:AttachUserPolicy
                - iam:PutRolePolicy
                - iam:AttachRolePolicy
                - secretsmanager:GetSecretValue
                - ssm:GetDocument
        selection_ioc_ip:
            sourceIPAddress:
                - 107.151.188.91
                - 112.215.253.179
                - 114.122.132.171
                - 140.213.98.125
                - 140.213.103.106
                - 140.213.103.218
                - 84.32.188.147
        selection_ioc_ua:
            userAgent|contains: aws-sdk-go-v2/1.21.2
        condition: selection and (selection_ioc_ip or selection_ioc_ua)
    level: high
-   tags:
        - attack.persistence
        - attack.t1136
        - attack.t1136.003
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: iam.amazonaws.com
            eventName:
                - CreateUser
                - CreateLoginProfile
            requestParameters.userName: DangerDev@protonmail.me
        selection_ioc_ip:
            sourceIPAddress:
                - 107.151.188.91
                - 112.215.253.179
                - 114.122.132.171
                - 140.213.98.125
                - 140.213.103.106
                - 140.213.103.218
                - 84.32.188.147
        selection_ioc_ua:
            userAgent|contains: aws-sdk-go-v2/1.21.2
        condition: selection and (selection_ioc_ip or selection_ioc_ua)
    level: high
-   tags:
        - attack.t1619
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: s3.amazonaws.com
            eventName: ListBuckets
        selection_ioc_ip:
            sourceIPAddress:
                - 107.151.188.91
                - 112.215.253.179
                - 114.122.132.171
                - 140.213.98.125
                - 140.213.103.106
                - 140.213.103.218
                - 84.32.188.147
        selection_ioc_ua:
            userAgent|contains: aws-sdk-go-v2/1.21.2
        condition: selection and (selection_ioc_ip or selection_ioc_ua)
    level: low
-   tags:
        - attack.privilege_escalation
        - attack.t1098
        - attack.t1098.003
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: iam.amazonaws.com
            eventName:
            - AttachUserPolicy
            - UpdateLoginProfile
            requestParameters.policyArn|endswith: '/AdministratorAccess'
        selection_ioc_ip:
            sourceIPAddress:
                - 107.151.188.91
                - 112.215.253.179
                - 114.122.132.171
                - 140.213.98.125
                - 140.213.103.106
                - 140.213.103.218
                - 84.32.188.147
        selection_ioc_ua:
            userAgent|contains: aws-sdk-go-v2/1.21.2
        condition: selection and (selection_ioc_ip or selection_ioc_ua)
    level: high
-   tags:
        - attack.impact
        - attack.t1496
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: ec2.amazonaws.com
            eventName: RunInstances
            requestParameters.instanceType:
                - p3.16xlarge
                - g4dn.12xlarge
                - p2.16xlarge
        selection_ioc_ip:
            sourceIPAddress:
                - 107.151.188.91
                - 112.215.253.179
                - 114.122.132.171
                - 140.213.98.125
                - 140.213.103.106
                - 140.213.103.218
                - 84.32.188.147
        selection_ioc_ua:
            userAgent|contains: aws-sdk-go-v2/1.21.2
        condition: selection and (selection_ioc_ip or selection_ioc_ua)
    level: high
-   tags:
        - attack.defense_evasion
        - attack.t1070
        - attack.impact
        - attack.t1531
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: iam.amazonaws.com
            eventName:
                - DeleteUser
                - DetachUserPolicy
                - DeleteUserPolicy
        selection_ioc_ip:
            sourceIPAddress:
                - 107.151.188.91
                - 112.215.253.179
                - 114.122.132.171
                - 140.213.98.125
                - 140.213.103.106
                - 140.213.103.218
                - 84.32.188.147
        selection_ioc_ua:
            userAgent|contains: aws-sdk-go-v2/1.21.2
        condition: selection and (selection_ioc_ip or selection_ioc_ua)
    level: high
-   tags:
        - attack.defense_evasion
        - attack.t1070
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: iam.amazonaws.com
            eventName:
                - UpdateAccessKey
                - DeleteAccessKey
        selection_ioc_ip:
            sourceIPAddress:
                - 107.151.188.91
                - 112.215.253.179
                - 114.122.132.171
                - 140.213.98.125
                - 140.213.103.106
                - 140.213.103.218
                - 84.32.188.147
        selection_ioc_ua:
            userAgent|contains: aws-sdk-go-v2/1.21.2
        condition: selection and (selection_ioc_ip or selection_ioc_ua)
    level: high
-   tags:
        - attack.defense_evasion
        - attack.t1562
        - attack.discovery
        - attack.t1580
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: guardduty.amazonaws.com
            eventName:
                - ListFindings
                - GetFindings
        selection_ioc_ip:
            sourceIPAddress:
                - 107.151.188.91
                - 112.215.253.179
                - 114.122.132.171
                - 140.213.98.125
                - 140.213.103.106
                - 140.213.103.218
                - 84.32.188.147
        selection_ioc_ua:
            userAgent|contains: aws-sdk-go-v2/1.21.2
        condition: selection and (selection_ioc_ip or selection_ioc_ua)
    level: medium
-   tags:
        - attack.defense_evasion
        - attack.t1578
        - attack.persistence
        - attack.t1136
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection:
            eventSource: lightsail.amazonaws.com
            eventName: CreateInstances
        selection_ioc_ip:
            sourceIPAddress:
                - 107.151.188.91
                - 112.215.253.179
                - 114.122.132.171
                - 140.213.98.125
                - 140.213.103.106
                - 140.213.103.218
                - 84.32.188.147
        selection_ioc_ua:
            userAgent|contains: aws-sdk-go-v2/1.21.2
        condition: selection and (selection_ioc_ip or selection_ioc_ua)
    level: high