-   tags:
        - attack.execution
        - attack.t1578
        - attack.impact
        - attack.t1496
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection_ec2:
            eventSource: ec2.amazonaws.com
            eventName: RunInstances
        selection_error:
            errorCode:
                - 'Client.UnauthorizedOperation'
                - 'AccessDenied'
            errorMessage|contains: 'You are not authorized to perform this operation'
        condition: selection_ec2 and selection_error
    level: high
-   tags:
        - attack.discovery
        - attack.t1069
        - attack.t1087
    logsource:
        product: aws
        service: cloudtrail
    detection:
        selection_iam:
            eventSource: iam.amazonaws.com
            eventName:
                - 'Get*'
                - 'List*'
        selection_error:
            errorCode: 'Client.UnauthorizedOperation'
            errorMessage|contains: 'You are not authorized to perform this operation'
        condition: selection_iam and selection_error
    level: low